test_cases/2d_r134a/Wedge_Throttle_LES/constant/coarsePolyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: 1659                                  |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2e-09/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       14990;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       15054;
    }
    centerline
    {
        type            empty;
        nFaces          0;
        startFace       15118;
    }
    wall
    {
        type            wall;
        nFaces          260;
        startFace       15118;
    }
    frontAndBackPlanes
    {
        type            empty;
        nFaces          0;
        startFace       15378;
    }
    frontAndBackPlanes_pos
    {
        type            wedge;
        nFaces          7662;
        startFace       15378;
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
        nFaces          7662;
        startFace       23040;
    }
)

// ************************************************************************* //
